   # Learning Python

## Pandas

In [1]:
# Python Version
from platform import python_version
print(python_version())

3.8.5

In [2]:
import pandas as pd
pd.__version__

'1.1.3'

In [3]:
from pandas import Series

## Series

One-dimensional ndarray with axis labels (including time series).

In [4]:
obj1 = Series([67, 78, -56, 13])

In [5]:
print(obj1)

0    67
1    78
2   -56
3    13
dtype: int64

In [6]:
type(obj1)

pandas.core.series.Series

In [7]:
obj1.values

array([ 67,  78, -56,  13])

In [8]:
obj1.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = Series([67, 78, -56, 13], index = ['a', 'b', 'c', 'd'])

In [10]:
obj2

a    67
b    78
c   -56
d    13
dtype: int64

In [11]:
obj2.values

array([ 67,  78, -56,  13])

In [12]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [13]:
obj2[obj2 > 0]

a    67
b    78
d    13
dtype: int64

In [14]:
'd' in obj2

True

In [15]:
dict1 = {'Football':5200, 'Tenis': 120, 'Swimming':698, 'Volleyball':1550}

In [16]:
obj3 = Series(dict1)

In [17]:
obj3

Football      5200
Tenis          120
Swimming       698
Volleyball    1550
dtype: int64

In [18]:
type(obj3)

pandas.core.series.Series

In [19]:
list1 = ['Football', 'Tenis', 'Swimming', 'Basktetball']

In [20]:
obj4 = Series(dict1, index=list1)

In [21]:
obj4

Football       5200.0
Tenis           120.0
Swimming        698.0
Basktetball       NaN
dtype: float64

In [22]:
pd.isnull(obj4)

Football       False
Tenis          False
Swimming       False
Basktetball     True
dtype: bool

In [23]:
pd.notnull(obj4)

Football        True
Tenis           True
Swimming        True
Basktetball    False
dtype: bool

In [24]:
obj4.isnull()

Football       False
Tenis          False
Swimming       False
Basktetball     True
dtype: bool

In [25]:
obj3

Football      5200
Tenis          120
Swimming       698
Volleyball    1550
dtype: int64

In [26]:
obj4

Football       5200.0
Tenis           120.0
Swimming        698.0
Basktetball       NaN
dtype: float64

In [27]:
obj5 = obj3 + obj4

In [28]:
obj5

Basktetball        NaN
Football       10400.0
Swimming        1396.0
Tenis            240.0
Volleyball         NaN
dtype: float64

In [29]:
obj5.name = 'population'

In [30]:
obj5.index.name = 'sports'

In [31]:
obj5

sports
Basktetball        NaN
Football       10400.0
Swimming        1396.0
Tenis            240.0
Volleyball         NaN
Name: population, dtype: float64

## Dataframes

Two-dimensional, size-mutable, potentially heterogeneous tabular data.

Data structure also contains labeled axes (rows and columns). Arithmetic operations align on both row and column labels. Can be thought of as a dict-like container for Series objects. The primary pandas data structure.

In [1]:
from pandas import DataFrame

In [2]:
data = {'state': ['Santa Catarina', 'Parana', 'Goias', 'Bahia', 'Minas Gerais'],
        'year': [2002, 2003, 2004, 2005, 2006],
        'population': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [3]:
frame = DataFrame(data)

In [4]:
frame

            state  year  population
0  Santa Catarina  2002         1.5
1          Parana  2003         1.7
2           Goias  2004         3.6
3           Bahia  2005         2.4
4    Minas Gerais  2006         2.9

In [5]:
type(frame)

pandas.core.frame.DataFrame

In [6]:
frame2 = DataFrame(data, columns = ['year', 'state', 'population', 'area'], 
                   index = ['one', 'two', 'three', 'four', 'five'])

In [7]:
type(frame2)

pandas.core.frame.DataFrame

In [8]:
frame2

       year           state  population area
one    2002  Santa Catarina         1.5  NaN
two    2003          Parana         1.7  NaN
three  2004           Goias         3.6  NaN
four   2005           Bahia         2.4  NaN
five   2006    Minas Gerais         2.9  NaN

In [22]:
frame2['state']

one      Santa Catarina
two              Parana
three             Goias
four              Bahia
five       Minas Gerais
Name: state, dtype: object

In [23]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [24]:
frame2.columns

Index(['year', 'state', 'population', 'area'], dtype='object')

In [25]:
frame2.values

array([[2002, 'Santa Catarina', 1.5, nan],
       [2003, 'Parana', 1.7, nan],
       [2004, 'Goias', 3.6, nan],
       [2005, 'Bahia', 2.4, nan],
       [2006, 'Minas Gerais', 2.9, nan]], dtype=object)

In [26]:
frame2.year

one      2002
two      2003
three    2004
four     2005
five     2006
Name: year, dtype: int64

In [27]:
frame2['year']

one      2002
two      2003
three    2004
four     2005
five     2006
Name: year, dtype: int64

In [28]:
frame2[:2]

     year           state  population area
one  2002  Santa Catarina         1.5  NaN
two  2003          Parana         1.7  NaN

In [31]:
frame[:2]

            state  year  population
0  Santa Catarina  2002         1.5
1          Parana  2003         1.7